Revit 2027 API
BuiltInFailures.FamilyFailures.InvalidParameterValue Property
 Parameter [Caption] has an invalid value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidParameterValue { get; }
Public Shared ReadOnly Property InvalidParameterValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidParameterValue {
	FailureDefinitionId^ get ();
}
static member InvalidParameterValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace